In [1]:
import pandas as pd

In [3]:
ser = pd.Series(data = [100, 200, 300, 400,  500], index = [ 'a', 'b', 'c', 'd', 'e'])

In [4]:
ser

a    100
b    200
c    300
d    400
e    500
dtype: int64

In [5]:
ser.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [8]:
ser = pd.Series([100, 'abc', 300, 400,  500], index = [ 'a', 'b', 'c', 'd', 'e'])

In [9]:
ser

a    100
b    abc
c    300
d    400
e    500
dtype: object

In [10]:
ser['a']

100

In [11]:
ser.loc['a']

100

In [12]:
ser[['a', 'b']]

a    100
b    abc
dtype: object

In [13]:
ser[[1, 3]]

b    abc
d    400
dtype: object

In [14]:
500 in ser

False

In [15]:
'e' in ser

True

In [16]:
ser * 2

a       200
b    abcabc
c       600
d       800
e      1000
dtype: object

In [17]:
ser.iloc[2]

300

In [18]:
ser[['a', 'c']]  ** 2

a    10000
c    90000
dtype: object

In [24]:
d = {'first' : pd.Series(data = [10, 20, 30, 40], index = ['a', 'b', 'c', 'd']), 
     'second' : pd.Series(data = [50, 60, 70, 80, 90], index = ['a', 'b', 'c', 'd', 'e'])}

In [25]:
df = pd.DataFrame(d)
df

   first  second
a   10.0      50
b   20.0      60
c   30.0      70
d   40.0      80
e    NaN      90

In [26]:
print(df)

   first  second
a   10.0      50
b   20.0      60
c   30.0      70
d   40.0      80
e    NaN      90

In [27]:
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [28]:
df.columns

Index(['first', 'second'], dtype='object')

In [29]:
pd.DataFrame(d, index = ['a', 'c'])

   first  second
a     10      50
c     30      70

In [32]:
pd.DataFrame(d, index = ['a', 'c'], columns = ['first', 'third'])

   first third
a     10   NaN
c     30   NaN

In [33]:
data = [{'first' : 1, 'second' : 2 }, {'second' : 22, 'third' : 3}]

In [34]:
pd.DataFrame(data)

   first  second  third
0    1.0       2    NaN
1    NaN      22    3.0

In [35]:
pd.DataFrame(data, index = ['aa', 'bb'])

    first  second  third
aa    1.0       2    NaN
bb    NaN      22    3.0

In [36]:
pd.DataFrame(data, index = ['aa', 'bb'], columns = ['first', 'third'])

    first  third
aa    1.0    NaN
bb    NaN    3.0

In [37]:
df

   first  second
a   10.0      50
b   20.0      60
c   30.0      70
d   40.0      80
e    NaN      90

In [39]:
df['first']

a    10.0
b    20.0
c    30.0
d    40.0
e     NaN
Name: first, dtype: float64

In [40]:
df['third'] = df['first'] * df['second']

In [41]:
df

   first  second   third
a   10.0      50   500.0
b   20.0      60  1200.0
c   30.0      70  2100.0
d   40.0      80  3200.0
e    NaN      90     NaN

In [42]:
third = df.pop('third')

In [43]:
third

a     500.0
b    1200.0
c    2100.0
d    3200.0
e       NaN
Name: third, dtype: float64

In [44]:
df

   first  second
a   10.0      50
b   20.0      60
c   30.0      70
d   40.0      80
e    NaN      90

In [45]:
del df['second']

In [46]:
df

   first
a   10.0
b   20.0
c   30.0
d   40.0
e    NaN

In [47]:
df.insert(1, 'copy_of_first', df['first'])

In [48]:
df

   first  copy_of_first
a   10.0           10.0
b   20.0           20.0
c   30.0           30.0
d   40.0           40.0
e    NaN            NaN

In [50]:
df['first_upper_half'] = df['first'][:2]
df

   first  copy_of_first  first_upper_half
a   10.0           10.0              10.0
b   20.0           20.0              20.0
c   30.0           30.0               NaN
d   40.0           40.0               NaN
e    NaN            NaN               NaN